In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ---------------------------------------- 43.8/43.8 kB 2.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [36]:
import pymysql as ps
conn = ps.connect(host='127.0.0.1',user='root',password='1234',charset='utf8')
cursor = conn.cursor()

In [14]:
import pandas as pd
import numpy as np

In [4]:
sql = 'create database if not exists flask_db;'
cursor.execute(sql)

1

In [38]:
sql = 'use flask_db;'
cursor.execute(sql)

0

In [12]:
sql = """
create table if not exists member(
    id int not null auto_increment primary key,
    userid varchar(50) not null,
    pwd varchar(200) not null,
    name varchar(20),
    email varchar(50),
    regdate datetime
);
"""

cursor.execute(sql)

0

In [11]:
sql = 'drop table member'
cursor.execute(sql)

0

In [17]:
sql = """
insert into member values
(1, 'aaa', '1234', '아이유', 'aaa@aaa.co.kr', '2019-06-24'),
(2, 'bbb', '1234', '방탄아미', 'dfs@aaa.co.kr', '2011-05-21');
"""
cursor.execute(sql)

2

In [19]:
sql = 'select * from member;'
pd.read_sql(sql, conn)

C:\Users\h\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id userid   pwd  name          email    regdate
0   1    aaa  1234   아이유  aaa@aaa.co.kr 2019-06-24
1   2    bbb  1234  방탄아미  dfs@aaa.co.kr 2011-05-21

In [22]:
sql = """
create table if not exists point_table(
point_stu_idx int,
point_stu_grade varchar(50),
point_stu_kor varchar(50)
);
"""
cursor.execute(sql)

0

In [24]:
sql = """
insert into point_table values
(2, '2', '90'),
(2, '3', '95'),
(1, '1', '85');
"""
cursor.execute(sql)

3

In [25]:
sql = 'select * from point_table;'
pd.read_sql(sql, conn)

C:\Users\h\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   point_stu_idx point_stu_grade point_stu_kor
0              2               2            90
1              2               3            95
2              1               1            85

In [26]:
sql = """
create table if not exists student_table(
stu_idx int,
stu_name varchar(50),
stu_age varchar(4),
stu_addr varchar(50)
);
"""
cursor.execute(sql)

0

In [27]:
sql = """
insert into student_table values
(1, '홍길동', '18', '서울시'),
(2, '김개호', '25', '서울시');
"""
cursor.execute(sql)

2

In [28]:
sql = 'select * from student_table;'
pd.read_sql(sql, conn)

C:\Users\h\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   stu_idx stu_name stu_age stu_addr
0        1      홍길동      18      서울시
1        2      김개호      25      서울시

In [39]:
sql = 'show tables;'
pd.read_sql(sql,conn)

  Tables_in_flask_db
0             member
1        point_table
2      student_table

In [32]:
conn.commit()

In [34]:
conn.close()